 <h1 style="color:blue;text-align:center">Sheet II</h1>

 <h4 style="color:green;text-align:center">Exercise 1</h4>

In [11]:
install.packages("dplyr")

Installing package into ‘/home/jrana/R/x86_64-pc-linux-gnu-library/4.2’
(as ‘lib’ is unspecified)

In [12]:
library("dplyr")

In [3]:
s1 <- tibble(
student = c("Adam","Bernd","Christian","Doris"),
algebra = c(NA, 5, 3, 4),
analysis = c(2, NA, 1,3),
diskrete.math = c(3,NA,2,4),
)
s2 <- tibble(
name = rep(c("Adam", "Bernd", "Christian", "Doris"), each = 2),
type = rep(c("height", "weight"), 4),
measure = c(1.83, 81, 1.75, 71, 1.69, 55, 1.57, 62))
s3 <- tibble(
name = c("Adam", "Bernd", "Christian", "Doris"),
ratio = c("81/1.83", "71/1.75", "55/1.69", "62/1.57"))

In [10]:
s1

  student   algebra analysis diskrete.math
1 Adam      NA       2        3
2 Bernd      5      NA       NA
3 Christian  3       1        2
4 Doris      4       3        4

In [5]:
s2

  name      type   measure
1 Adam      height  1.83
2 Adam      weight 81.00
3 Bernd     height  1.75
4 Bernd     weight 71.00
5 Christian height  1.69
6 Christian weight 55.00
7 Doris     height  1.57
8 Doris     weight 62.00

In [6]:
s3

  name      ratio
1 Adam      81/1.83
2 Bernd     71/1.75
3 Christian 55/1.69
4 Doris     62/1.57

## s1
 + contains 3 variables
   + name, exam, grade
 + 36 values and 12 observations

## s2 & s3
 + contains 12 values
 + three variables
   + name, type, measure
 + 3 observation for every student

## why are these datasets not tidy?
  + **s1**
     + column headers are values of the variable exam, not variable name.
  + **s2**
    + the variable weight and height are stored both in cols and rows
  + **s3**
    + the values of weight and height are stored in one column

In [13]:
install.packages("tidyr")

Installing package into ‘/home/jrana/R/x86_64-pc-linux-gnu-library/4.2’
(as ‘lib’ is unspecified)

In [14]:
library("tidyr")

## Make a tidy version of all datasets.

In [21]:
s1

  student   algebra analysis diskrete.math
1 Adam      NA       2        3
2 Bernd      5      NA       NA
3 Christian  3       1        2
4 Doris      4       3        4

In [18]:
s1  %>% gather("algebra","analysis","diskrete.math",
               key="exam",value="grade")->s1_new
s1_new

   student   exam          grade
1  Adam      algebra       NA
2  Bernd     algebra        5
3  Christian algebra        3
4  Doris     algebra        4
5  Adam      analysis       2
6  Bernd     analysis      NA
7  Christian analysis       1
8  Doris     analysis       3
9  Adam      diskrete.math  3
10 Bernd     diskrete.math NA
11 Christian diskrete.math  2
12 Doris     diskrete.math  4

In [19]:
dim(s1_new)

[1] 12  3

In [20]:
s2

  name      type   measure
1 Adam      height  1.83
2 Adam      weight 81.00
3 Bernd     height  1.75
4 Bernd     weight 71.00
5 Christian height  1.69
6 Christian weight 55.00
7 Doris     height  1.57
8 Doris     weight 62.00

In [18]:
s2 %>% spread(key=type, value=measure)

  name      height weight
1 Adam      1.83   81
2 Bernd     1.75   71
3 Christian 1.69   55
4 Doris     1.57   62

In [22]:
s3

  name      ratio
1 Adam      81/1.83
2 Bernd     71/1.75
3 Christian 55/1.69
4 Doris     62/1.57

In [25]:
s3 %>% separate(col = ratio, into=c("weight","height"),sep = "/")->s3_nw
s3_nw

  name      weight height
1 Adam      81     1.83
2 Bernd     71     1.75
3 Christian 55     1.69
4 Doris     62     1.57

In [28]:
s3_nw %>% unite(col="ratio",weight,height,sep="-")

  name      ratio
1 Adam      81-1.83
2 Bernd     71-1.75
3 Christian 55-1.69
4 Doris     62-1.57

## some more examples of <code style="color:green">gather()</code>, <code style="color:green">seperate()</code>, <code style="color:green">spread()</code>,<code style="color:green">unite()</code>

In [31]:
table1

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [41]:
table1 %>% select(-population) %>% spread(key=year,value=cases)

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [42]:
table1 %>% select(-cases) %>% spread(key=year,value=population)

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

## table1 > table2

In [46]:
table1 %>% gather(cases,population,key="type",value="count") %>% arrange(country)

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 2000 cases            2666
3  Afghanistan 1999 population   19987071
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      2000 cases           80488
7  Brazil      1999 population  172006362
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       2000 cases          213766
11 China       1999 population 1272915272
12 China       2000 population 1280428583

In [43]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

## table2 > table1

In [48]:
table2 %>% spread(key =type,value=count )

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [33]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [51]:
table3 %>% separate(col = rate,into=c("cases","population"),sep="/")

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [34]:
table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [35]:
table4b

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

In [36]:
table5

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

 <h4 style="color:green;text-align:center">Exercise 2</h4>

+ Calculate the value of $sin(log( \sqrt{5 + 3}))$ directly and using the % >
   %-operator.

In [53]:
sin(log(sqrt(5+3))) ## nested

[1] 0.8622628

In [58]:
c(5+3) %>% sum() %>% sqrt() %>% log() %>% sin() ## using %>% operator

[1] 0.8622628

+ Define a vector v with values 0.5,1,1.5,...,5 and calculate the by 2
  digits rounded sum of the logarithms of the squared values of v
  with nested operations and using the % > %-operator.

In [65]:
v<-seq(from = 0.5 ,to=5,by=0.5)
v

 [1] 0.5 1.0 1.5 2.0 2.5 3.0 3.5 4.0 4.5 5.0

In [70]:
round(sum(log10(v**2)),2) ## nested

[1] 7.1

In [71]:
myfun<-function(vec){
    return(vec**2)
}

In [72]:
myfun(2)

[1] 4

In [73]:
myfun(c(2,3,4))

[1]  4  9 16

In [76]:
v %>% myfun() %>% log10() %>% sum() %>% round(2) ## using %>% op

[1] 7.1

 <h4 style="color:green;text-align:center">Exercise 3</h4>

Create a tibble df with the data of 10 students, i.e. with 10 rows and
the columns id (values 1,2,..., 10), sex (values are “f” and “m”, age
(integer values between 20 and 35) and score1 (integer values between
0 and 25). You can choose arbitrary values in the columns. If you do
not like coding the values by hand you can use:

In [93]:
df<-tibble(id=1:10,sex=sample(x=c("F","M"),size=10,replace=T),
          age=round(runif(10,20,35)),
          score1=round(runif(10,0,25))
          )
df

   id sex age score1
1   1 M   29  22
2   2 F   25  12
3   3 F   27   3
4   4 M   22  12
5   5 M   24  16
6   6 M   22  21
7   7 F   26  23
8   8 F   29  22
9   9 M   35  14
10 10 M   32  24

+ Select the date of all male students

In [94]:
df %>% filter(sex=="M")

  id sex age score1
1  1 M   29  22
2  4 M   22  12
3  5 M   24  16
4  6 M   22  21
5  9 M   35  14
6 10 M   32  24

+ Add the data of a new student with id = 11, sex = “m”, age =
   25 and score1 = 4.

In [95]:
add_row(.data=df,id=11,sex='M',age=25,score1=4 )->df
df

   id sex age score1
1   1 M   29  22
2   2 F   25  12
3   3 F   27   3
4   4 M   22  12
5   5 M   24  16
6   6 M   22  21
7   7 F   26  23
8   8 F   29  22
9   9 M   35  14
10 10 M   32  24
11 11 M   25   4

+ Add two columns score2 and score3 with random integer numbers
  between 0 and 25.

In [96]:
df %>% mutate("score2"=sample(x = 0:25,size=11,replace=T),
              "score3"=sample(x = 0:25,size=11,replace=T)
             ) -> df
df

   id sex age score1 score2 score3
1   1 M   29  22     15     20
2   2 F   25  12      9     13
3   3 F   27   3     13      0
4   4 M   22  12     20      6
5   5 M   24  16      3     17
6   6 M   22  21     12     12
7   7 F   26  23      3     13
8   8 F   29  22      4     18
9   9 M   35  14     19     17
10 10 M   32  24     16      0
11 11 M   25   4      3     14

+ Add a column containing sum of all scores.

In [110]:
df %>% mutate("total"=score1+score2+score3) ->df
df

   id sex age score1 score2 score3 total
1   1 M   29  22     15     20     57
2   2 F   25  12      9     13     34
3   3 F   27   3     13      0     16
4   4 M   22  12     20      6     38
5   5 M   24  16      3     17     36
6   6 M   22  21     12     12     45
7   7 F   26  23      3     13     39
8   8 F   29  22      4     18     44
9   9 M   35  14     19     17     50
10 10 M   32  24     16      0     40
11 11 M   25   4      3     14     21

 + Add a column which denote the grades according to the scheme
 </br>
$$ 
grad =
\begin{cases}
    5 & \text{if} & \text{total} \leq 37 \\
    4 & \text{if} & 45 \ge \text{total} > 37 \\
    3 & \text{if} & 55 \ge \text{total} > 45 \\
    2 & \text{if} & 65 \ge \text{total} > 55 \\
    1 & \text{if} & \text{total} \ge 65 \\
\end{cases}
$$

In [113]:
df %>% mutate("grad" = case_when(
    total <= 37 ~ 5,
    total > 37 & total <= 45 ~ 4,
    total > 45 & total <= 55 ~ 3,
    total > 55 & total <= 65 ~ 2,
    total > 65 ~ 1
  )) ->df
df

   id sex age score1 score2 score3 total grad
1   1 M   29  22     15     20     57    2
2   2 F   25  12      9     13     34    5
3   3 F   27   3     13      0     16    5
4   4 M   22  12     20      6     38    4
5   5 M   24  16      3     17     36    5
6   6 M   22  21     12     12     45    4
7   7 F   26  23      3     13     39    4
8   8 F   29  22      4     18     44    4
9   9 M   35  14     19     17     50    3
10 10 M   32  24     16      0     40    4
11 11 M   25   4      3     14     21    5

+ Find the values of the variables id, sex and grade sorted by the
   values of sex of all students who have passed

In [117]:
df %>% filter(grad>=4) %>% select(id,sex,grad) %>% arrange(sex)

  id sex grad
1  2 F   5
2  3 F   5
3  7 F   4
4  8 F   4
5  4 M   4
6  5 M   5
7  6 M   4
8 10 M   4
9 11 M   5

+ Calculate the mean, minimum, maximum and median of the vari-
  able sum of scores grouped by the variable sex.

In [118]:
df %>% group_by(sex) %>% summarise(
    mean=mean(total),
    min=min(total),
    max=max(total),
    mid=median(total)
)

  sex mean  min max mid
1 F   33.25 16  44  36.5
2 M   41.00 21  57  40.0

In [120]:
df %>% group_by(sex) -> df_groupd

In [121]:
df_groupd %>% group_split()

<list_of<
  tbl_df<
    id    : double
    sex   : character
    age   : double
    score1: double
    score2: integer
    score3: integer
    total : double
    grad  : double
  >
>[2]>
[[1]]
# A tibble: 4 × 8
     id sex     age score1 score2 score3 total  grad
  <dbl> <chr> <dbl>  <dbl>  <int>  <int> <dbl> <dbl>
1     2 F        25     12      9     13    34     5
2     3 F        27      3     13      0    16     5
3     7 F        26     23      3     13    39     4
4     8 F        29     22      4     18    44     4

[[2]]
# A tibble: 7 × 8
     id sex     age score1 score2 score3 total  grad
  <dbl> <chr> <dbl>  <dbl>  <int>  <int> <dbl> <dbl>
1     1 M        29     22     15     20    57     2
2     4 M        22     12     20      6    38     4
3     5 M        24     16      3     17    36     5
4     6 M        22     21     12     12    45     4
5     9 M        35     14     19     17    50     3
6    10 M        32     24     16      0    40     4
7    11 M        25      4      3     14    21     5

 <h4 style="color:green;text-align:center">Exercise 4</h4>

In [124]:
no <- 30
df <- tibble(
stud.id = 1:no,
group = sample(x=c("A","B","C"), size=no, replace = TRUE),
ex1 = sample(x=1:10, size=no, replace = TRUE),
ex2= sample(x=1:10, size=no, replace = TRUE),
ex3 = sample(x=1:10, size=no, replace = TRUE),
ex4 = sample(x=1:10, size=no, replace = TRUE),
ex5 = sample(x=1:10, size=no, replace = TRUE)
)
df %>% slice(1:6)

  stud.id group ex1 ex2 ex3 ex4 ex5
1 1       C     4   4   1    7  9
2 2       C     7   4   2    3  3
3 3       B     5   6   6    8  9
4 4       A     4   8   6   10  4
5 5       A     1   8   7    9  8
6 6       C     9   3   3    5  3

+ Apply n() and count() to get the number of students in the dif-
  ferent groups. What are the difference between n() and count()?

In [131]:
df %>% group_by(group) %>% summarise(cnt=n())

  group cnt
1 A      9
2 B      9
3 C     12

In [133]:
df %>% count(group) # first group by then count num of obs in each group

  group n
1 A      9
2 B      9
3 C     12

+ add the variables sum.scores and mean.scores containing the sum
    and the of the scores in the exercises for every student by apply-
    ing the the functions sum() and mean(). What is the result if
    rowwise() is appplied before the mutate()?

In [144]:
df %>% mutate( sum.scores=sum(c(ex1,ex2,ex3,ex4,ex5)),
               mean.scores=mean(c(ex1,ex2,ex3,ex4,ex5))
             )

   stud.id group ex1 ex2 ex3 ex4 ex5 sum.scores mean.scores
1   1      C      4   4   1   7   9  910        6.066667
2   2      C      7   4   2   3   3  910        6.066667
3   3      B      5   6   6   8   9  910        6.066667
4   4      A      4   8   6  10   4  910        6.066667
5   5      A      1   8   7   9   8  910        6.066667
6   6      C      9   3   3   5   3  910        6.066667
7   7      A      2   4   6   8   7  910        6.066667
8   8      C      7   6  10   3   2  910        6.066667
9   9      A      3   4   8   6   6  910        6.066667
10 10      A      3   8   9   2   5  910        6.066667
11 11      C      8   1   6   3   5  910        6.066667
12 12      A      7   7   8  10   4  910        6.066667
13 13      C      8  10   7   4   3  910        6.066667
14 14      B      8   6   6   2   5  910        6.066667
15 15      A      7   9   3   9   9  910        6.066667
16 16      B      3   1   7  10  10  910        6.066667
17 17      C      8  10   4   8   6  910        6.066667
18 18      C      6   1  10   6   1  910        6.066667
19 19      C      6   6   7   3   1  910        6.066667
20 20      A      9  10  10  10   8  910        6.066667
21 21      C     10   6   6   5   2  910        6.066667
22 22      B      9   5   6   8   7  910        6.066667
23 23      B      9   8   6   2   8  910        6.066667
24 24      B      7   8   6   9   1  910        6.066667
25 25      C      7   7   9  10   9  910        6.066667
26 26      B      4   7   6  10  10  910        6.066667
27 27      C      7   9   5   4   2  910        6.066667
28 28      B      6   2   7   2   5  910        6.066667
29 29      A     10   7   7   4   8  910        6.066667
30 30      B     10   3   4   6   4  910        6.066667

In [136]:
sum(df$ex1) + sum(df$ex2) + sum(df$ex3) + sum(df$ex4) + sum(df$ex5)

[1] 910

In [150]:
len<-length(c(df$ex1,df$ex2,df$ex3,df$ex4,df$ex5))
total<-sum(c(df$ex1,df$ex2,df$ex3,df$ex4,df$ex5))
total/len

[1] 6.066667

In [146]:
df %>%  rowwise() %>% mutate( sum.scores=sum(c(ex1,ex2,ex3,ex4,ex5)),
               mean.scores=mean(c(ex1,ex2,ex3,ex4,ex5))
             )

   stud.id group ex1 ex2 ex3 ex4 ex5 sum.scores mean.scores
1   1      C      4   4   1   7   9  25         5.0
2   2      C      7   4   2   3   3  19         3.8
3   3      B      5   6   6   8   9  34         6.8
4   4      A      4   8   6  10   4  32         6.4
5   5      A      1   8   7   9   8  33         6.6
6   6      C      9   3   3   5   3  23         4.6
7   7      A      2   4   6   8   7  27         5.4
8   8      C      7   6  10   3   2  28         5.6
9   9      A      3   4   8   6   6  27         5.4
10 10      A      3   8   9   2   5  27         5.4
11 11      C      8   1   6   3   5  23         4.6
12 12      A      7   7   8  10   4  36         7.2
13 13      C      8  10   7   4   3  32         6.4
14 14      B      8   6   6   2   5  27         5.4
15 15      A      7   9   3   9   9  37         7.4
16 16      B      3   1   7  10  10  31         6.2
17 17      C      8  10   4   8   6  36         7.2
18 18      C      6   1  10   6   1  24         4.8
19 19      C      6   6   7   3   1  23         4.6
20 20      A      9  10  10  10   8  47         9.4
21 21      C     10   6   6   5   2  29         5.8
22 22      B      9   5   6   8   7  35         7.0
23 23      B      9   8   6   2   8  33         6.6
24 24      B      7   8   6   9   1  31         6.2
25 25      C      7   7   9  10   9  42         8.4
26 26      B      4   7   6  10  10  37         7.4
27 27      C      7   9   5   4   2  27         5.4
28 28      B      6   2   7   2   5  22         4.4
29 29      A     10   7   7   4   8  36         7.2
30 30      B     10   3   4   6   4  27         5.4

 <h4 style="color:green;text-align:center">Exercise 5</h4>

In [154]:
install.packages("nycflights13")
library(nycflights13)

Installing package into ‘/home/jrana/R/x86_64-pc-linux-gnu-library/4.2’
(as ‘lib’ is unspecified)

In [160]:
df<-flights

+ Load the libraries tidyverse and nycflight13 and inspect the vari-
  able of flights.

In [161]:
df %>% slice(1:10)

   year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1  2013 1     1   517      515             2         830      819
2  2013 1     1   533      529             4         850      830
3  2013 1     1   542      540             2         923      850
4  2013 1     1   544      545            -1        1004     1022
5  2013 1     1   554      600            -6         812      837
6  2013 1     1   554      558            -4         740      728
7  2013 1     1   555      600            -5         913      854
8  2013 1     1   557      600            -3         709      723
9  2013 1     1   557      600            -3         838      846
10 2013 1     1   558      600            -2         753      745
   arr_delay carrier flight tailnum origin dest air_time distance hour minute
1   11       UA      1545   N14228  EWR    IAH  227      1400     5    15
2   20       UA      1714   N24211  LGA    IAH  227      1416     5    29
3   33       AA      1141   N619AA  JFK    MIA  160      1089     5    40
4  -18       B6       725   N804JB  JFK    BQN  183      1576     5    45
5  -25       DL       461   N668DN  LGA    ATL  116       762     6     0
6   12       UA      1696   N39463  EWR    ORD  150       719     5    58
7   19       B6       507   N516JB  EWR    FLL  158      1065     6     0
8  -14       EV      5708   N829AS  LGA    IAD   53       229     6     0
9   -8       B6        79   N593JB  JFK    MCO  140       944     6     0
10   8       AA       301   N3ALAA  LGA    ORD  138       733     6     0
   time_hour
1  2013-01-01 05:00:00
2  2013-01-01 05:00:00
3  2013-01-01 05:00:00
4  2013-01-01 05:00:00
5  2013-01-01 06:00:00
6  2013-01-01 05:00:00
7  2013-01-01 06:00:00
8  2013-01-01 06:00:00
9  2013-01-01 06:00:00
10 2013-01-01 06:00:00

In [162]:
dim(df)

[1] 336776     19

In [163]:
names(df)

 [1] "year"           "month"          "day"            "dep_time"
 [5] "sched_dep_time" "dep_delay"      "arr_time"       "sched_arr_time"
 [9] "arr_delay"      "carrier"        "flight"         "tailnum"
[13] "origin"         "dest"           "air_time"       "distance"
[17] "hour"           "minute"         "time_hour"

## check for null values

In [164]:
colSums(is.na(df))

          year          month            day       dep_time sched_dep_time
             0              0              0           8255              0
     dep_delay       arr_time sched_arr_time      arr_delay        carrier
          8255           8713              0           9430              0
        flight        tailnum         origin           dest       air_time
             0           2512              0              0           9430
      distance           hour         minute      time_hour
             0              0              0              0

In [165]:
sum(is.na(df$year))

[1] 0

In [166]:
sum(is.na(df$air_time))

[1] 9430

In [169]:
print(str(df))

tibble [336,776 × 19] (S3: tbl_df/tbl/data.frame)
 $ year          : int [1:336776] 2013 2013 2013 2013 2013 2013 2013 2013 2013 2013 ...
 $ month         : int [1:336776] 1 1 1 1 1 1 1 1 1 1 ...
 $ day           : int [1:336776] 1 1 1 1 1 1 1 1 1 1 ...
 $ dep_time      : int [1:336776] 517 533 542 544 554 554 555 557 557 558 ...
 $ sched_dep_time: int [1:336776] 515 529 540 545 600 558 600 600 600 600 ...
 $ dep_delay     : num [1:336776] 2 4 2 -1 -6 -4 -5 -3 -3 -2 ...
 $ arr_time      : int [1:336776] 830 850 923 1004 812 740 913 709 838 753 ...
 $ sched_arr_time: int [1:336776] 819 830 850 1022 837 728 854 723 846 745 ...
 $ arr_delay     : num [1:336776] 11 20 33 -18 -25 12 19 -14 -8 8 ...
 $ carrier       : chr [1:336776] "UA" "UA" "AA" "B6" ...
 $ flight        : int [1:336776] 1545 1714 1141 725 461 1696 507 5708 79 301 ...
 $ tailnum       : chr [1:336776] "N14228" "N24211" "N619AA" "N804JB" ...
 $ origin        : chr [1:336776] "EWR" "LGA" "JFK" "JFK" ...
 $ dest          : chr [1:336776] "IAH" "IAH" "MIA" "BQN" ...
 $ air_time      : num [1:336776] 227 227 160 183 116 150 158 53 140 138 ...
 $ distance      : num [1:336776] 1400 1416 1089 1576 762 ...
 $ hour          : num [1:336776] 5 5 5 5 6 5 6 6 6 6 ...
 $ minute        : num [1:336776] 15 29 40 45 0 58 0 0 0 0 ...
 $ time_hour     : POSIXct[1:336776], format: "2013-01-01 05:00:00" "2013-01-01 05:00:00" ...
NULL

In [172]:
df$carrier %>% table() %>% as_tibble()

   .  n
1  9E 18460
2  AA 32729
3  AS   714
4  B6 54635
5  DL 48110
6  EV 54173
7  F9   685
8  FL  3260
9  HA   342
10 MQ 26397
11 OO    32
12 UA 58665
13 US 20536
14 VX  5162
15 WN 12275
16 YV   601

+ Find all flights with more than 2 hours arrival delay.

In [176]:
df$arr_delay[df$arr_delay>2*60] %>% as_tibble()

      value
1     137
2     851
3     123
4     145
5     127
6     125
7      NA
8      NA
9     136
10    123
11    123
12     NA
13    138
14     NA
15    338
16    263
17    127
18    151
19    166
20     NA
21    174
22     NA
23    222
24    123
25     NA
26    250
27    142
28    246
29    127
30    191
⋮     ⋮
19435  NA
19436  NA
19437 134
19438 137
19439 208
19440  NA
19441 236
19442 181
19443 141
19444 124
19445 183
19446  NA
19447  NA
19448  NA
19449  NA
19450 131
19451 129
19452 272
19453 137
19454 121
19455 174
19456 136
19457 194
19458 130
19459  NA
19460  NA
19461  NA
19462  NA
19463  NA
19464  NA

In [178]:
df %>% filter(arr_delay>2*60) %>% slice(1:10)

   year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1  2013 1     1    811      630           101       1047      830
2  2013 1     1    848     1835           853       1001     1950
3  2013 1     1    957      733           144       1056      853
4  2013 1     1   1114      900           134       1447     1222
5  2013 1     1   1505     1310           115       1638     1431
6  2013 1     1   1525     1340           105       1831     1626
7  2013 1     1   1549     1445            64       1912     1656
8  2013 1     1   1558     1359           119       1718     1515
9  2013 1     1   1732     1630            62       2028     1825
10 2013 1     1   1803     1620           103       2008     1750
   arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  137       MQ      4576   N531MQ  LGA    CLT  118       544      6   30
2  851       MQ      3944   N942MQ  JFK    BWI   41       184     18   35
3  123       UA       856   N534UA  EWR    BOS   37       200      7   33
4  145       UA      1086   N76502  LGA    IAH  248      1416      9    0
5  127       EV      4497   N17984  EWR    RIC   63       277     13   10
6  125       B6       525   N231JB  EWR    MCO  152       937     13   40
7  136       EV      4181   N21197  EWR    MCI  234      1092     14   45
8  123       EV      5712   N826AS  JFK    IAD   53       228     13   59
9  123       EV      4092   N16911  EWR    DAY  119       533     16   30
10 138       MQ      4622   N504MQ  LGA    BNA  154       764     16   20
   time_hour
1  2013-01-01 06:00:00
2  2013-01-01 18:00:00
3  2013-01-01 07:00:00
4  2013-01-01 09:00:00
5  2013-01-01 13:00:00
6  2013-01-01 13:00:00
7  2013-01-01 14:00:00
8  2013-01-01 13:00:00
9  2013-01-01 16:00:00
10 2013-01-01 16:00:00

+ Find all flights with more tahn 2 hours arrival delay and no de-
  parture delay.

In [180]:
df %>% filter(arr_delay>2*60 & dep_delay<=0) %>% slice(1:10)

   year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1  2013  1    27  1419     1420           -1        1754     1550
2  2013 10     7  1350     1350            0        1736     1526
3  2013 10     7  1357     1359           -2        1858     1654
4  2013 10    16   657      700           -3        1258     1056
5  2013 11     1   658      700           -2        1329     1015
6  2013  3    18  1844     1847           -3          39     2219
7  2013  4    17  1635     1640           -5        2049     1845
8  2013  4    18   558      600           -2        1149      850
9  2013  4    18   655      700           -5        1213      950
10 2013  5    22  1827     1830           -3        2217     2010
   arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  124       MQ      3728   N1EAMQ  EWR    ORD  135       719     14   20
2  130       EV      5181   N611QX  LGA    MSN  117       812     13   50
3  124       AA      1151   N3CMAA  LGA    DFW  192      1389     13   59
4  122       B6         3   N703JB  JFK    SJU  225      1598      7    0
5  194       VX       399   N629VA  JFK    LAX  336      2475      7    0
6  140       UA       389   N560UA  JFK    SFO  386      2586     18   47
7  124       MQ      4540   N721MQ  LGA    DTW  130       502     16   40
8  179       AA       707   N3EXAA  LGA    DFW  234      1389      6    0
9  143       AA      2083   N565AA  EWR    DFW  230      1372      7    0
10 127       MQ      4674   N518MQ  LGA    CLE   90       419     18   30
   time_hour
1  2013-01-27 14:00:00
2  2013-10-07 13:00:00
3  2013-10-07 13:00:00
4  2013-10-16 07:00:00
5  2013-11-01 07:00:00
6  2013-03-18 18:00:00
7  2013-04-17 16:00:00
8  2013-04-18 06:00:00
9  2013-04-18 07:00:00
10 2013-05-22 18:00:00

+ Find all flights from United, American and Delta with no arrival
   delay.

In [182]:
df$carrier  %>% unique()

 [1] "UA" "AA" "B6" "DL" "EV" "MQ" "US" "WN" "VX" "FL" "AS" "9E" "F9" "HA" "YV"
[16] "OO"

In [183]:
df %>% filter(carrier %in% c("AA","DL","UA") & dep_delay<=0) %>% 
                                            slice(1:10)

   year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1  2013 1     1   554      600            -6        812      837
2  2013 1     1   554      558            -4        740      728
3  2013 1     1   558      600            -2        753      745
4  2013 1     1   558      600            -2        924      917
5  2013 1     1   558      600            -2        923      937
6  2013 1     1   559      600            -1        941      910
7  2013 1     1   559      600            -1        854      902
8  2013 1     1   602      610            -8        812      820
9  2013 1     1   606      610            -4        858      910
10 2013 1     1   606      610            -4        837      845
   arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  -25       DL       461   N668DN  LGA    ATL  116       762     6     0
2   12       UA      1696   N39463  EWR    ORD  150       719     5    58
3    8       AA       301   N3ALAA  LGA    ORD  138       733     6     0
4    7       UA       194   N29129  JFK    LAX  345      2475     6     0
5  -14       UA      1124   N53441  EWR    SFO  361      2565     6     0
6   31       AA       707   N3DUAA  LGA    DFW  257      1389     6     0
7   -8       UA      1187   N76515  EWR    LAS  337      2227     6     0
8   -8       DL      1919   N971DL  LGA    MSP  170      1020     6    10
9  -12       AA      1895   N633AA  EWR    MIA  152      1085     6    10
10  -8       DL      1743   N3739P  JFK    ATL  128       760     6    10
   time_hour
1  2013-01-01 06:00:00
2  2013-01-01 05:00:00
3  2013-01-01 06:00:00
4  2013-01-01 06:00:00
5  2013-01-01 06:00:00
6  2013-01-01 06:00:00
7  2013-01-01 06:00:00
8  2013-01-01 06:00:00
9  2013-01-01 06:00:00
10 2013-01-01 06:00:00

+ Find all flights from United, American and Delta in the month May with more than 5 hours arrival delay sorted by carrier and
  flight number.

In [185]:
df$month %>% unique()

 [1]  1 10 11 12  2  3  4  5  6  7  8  9

In [190]:
df %>% filter(
    carrier %in% c("AA","DL","UA") &
    month==5 & 
    arr_delay>5*60) %>% arrange(carrier,flight) %>% slice(1:10)

   year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1  2013 5     19   713     1700           853       1007     1955
2  2013 5     23  2246     1500           466         13     1645
3  2013 5      9  1839     1015           504       2123     1310
4  2013 5     16  2233     1340           533         59     1640
5  2013 5     23  2136     1545           351        113     1901
6  2013 5     17  2113     1259           494       2345     1530
7  2013 5     19   241     2000           401        355     2130
8  2013 5     25  1825     1159           386       2100     1454
9  2013 5     23  2042     1625           257       2340     1835
10 2013 5     18  1809     1200           369       2034     1432
   arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  852       AA       257   N3HEAA  JFK    LAS  323      2248     17    0
2  448       AA       341   N424AA  LGA    ORD  121       733     15    0
3  493       AA       731   N3BEAA  LGA    DFW  197      1389     10   15
4  499       AA       753   N3ERAA  LGA    DFW  184      1389     13   40
5  372       DL       141   N371NW  JFK    FLL  152      1069     15   45
6  495       DL       781   N960DL  LGA    ATL   93       762     12   59
7  385       DL       985   N326US  JFK    BOS   35       187     20    0
8  366       DL      1174   N900DE  LGA    PBI  127      1035     11   59
9  305       DL      1619   N377NW  LGA    MSP  143      1020     16   25
10 362       DL      1947   N963DL  LGA    ATL  104       762     12    0
   time_hour
1  2013-05-19 17:00:00
2  2013-05-23 15:00:00
3  2013-05-09 10:00:00
4  2013-05-16 13:00:00
5  2013-05-23 15:00:00
6  2013-05-17 12:00:00
7  2013-05-19 20:00:00
8  2013-05-25 11:00:00
9  2013-05-23 16:00:00
10 2013-05-18 12:00:00

+ Add a column speed which denotes the average speed of the flight
   and determine the carrier, flight of the top 10 values of speed.

In [196]:
df %>% mutate(speed=distance/air_time*60) %>%
        arrange(desc(speed)) %>% unique()  %>% top_n(n = 10,speed)

   year month day dep_time sched_dep_time dep_delay arr_time sched_arr_time
1  2013  5    25  1709     1700             9       1923     1937
2  2013  7     2  1558     1513            45       1745     1719
3  2013  5    13  2040     2025            15       2225     2226
4  2013  3    23  1914     1910             4       2045     2043
5  2013  1    12  1559     1600            -1       1849     1917
6  2013 11    17   650      655            -5       1059     1150
7  2013  2    21  2355     2358            -3        412      438
8  2013 11    17   759      800            -1       1212     1255
9  2013 11    16  2003     1925            38         17       36
10 2013 11    16  2349     2359           -10        402      440
11 2013 11    17   851      855            -4       1307     1345
12 2013 11    17  1926     1925             1          7       39
13 2013 12     5  1858     1900            -2       2313     2359
14 2013  2    10  1658     1700            -2       2125     2204
15 2013  2    10  1958     1855            63         31     2355
   arr_delay carrier flight tailnum origin dest air_time distance hour minute
1  -14       DL      1499   N666DN  LGA    ATL   65       762     17    0
2   26       EV      4667   N17196  EWR    MSP   93      1008     15   13
3   -1       EV      4292   N14568  EWR    GSP   55       594     20   25
4    2       EV      3805   N12567  EWR    BNA   70       748     19   10
5  -28       DL      1902   N956DL  LGA    PBI  105      1035     16    0
6  -51       DL       315   N3768   JFK    SJU  170      1598      6   55
7  -26       B6       707   N779JB  JFK    SJU  172      1598     23   58
8  -43       AA       936   N5FFAA  JFK    STT  175      1623      8    0
9  -19       DL       347   N3773D  JFK    SJU  173      1598     19   25
10 -38       B6      1503   N571JB  JFK    SJU  173      1598     23   59
11 -38       DL       301   N624AG  JFK    SJU  173      1598      8   55
12 -32       DL       347   N382DA  JFK    SJU  173      1598     19   25
13 -46       AA      1029   N617AA  JFK    SJU  173      1598     19    0
14 -39       DL       329   N371DA  JFK    SJU  173      1598     17    0
15  36       AA      1613   N625AA  JFK    SJU  173      1598     18   55
   time_hour           speed
1  2013-05-25 17:00:00 703.3846
2  2013-07-02 15:00:00 650.3226
3  2013-05-13 20:00:00 648.0000
4  2013-03-23 19:00:00 641.1429
5  2013-01-12 16:00:00 591.4286
6  2013-11-17 06:00:00 564.0000
7  2013-02-21 23:00:00 557.4419
8  2013-11-17 08:00:00 556.4571
9  2013-11-16 19:00:00 554.2197
10 2013-11-16 23:00:00 554.2197
11 2013-11-17 08:00:00 554.2197
12 2013-11-17 19:00:00 554.2197
13 2013-12-05 19:00:00 554.2197
14 2013-02-10 17:00:00 554.2197
15 2013-02-10 18:00:00 554.2197

+ Find a list of carriers with a column ratio which denotes the number of flights with arr delay less than 10 minutes to the total
    number of flights. The list should be sorted by ratio.